podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/TIM1_STM32F030.svd.xml
            <register>
               <name>CCMR2_Input</name>
               <description>capture/compare mode register 2 (input
          mode)</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>CC3S</name>
                     <description>Capture/compare 3
              selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IC3PSC</name>
                     <description>Input capture 3 prescaler</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IC3F</name>
                     <description>Input capture 3 filter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CC4S</name>
                     <description>Capture/Compare 4
              selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IC4PSC</name>
                     <description>Input capture 4 prescaler</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IC4F</name>
                     <description>Input capture 4 filter</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCMR2_Output</name>
               <description>capture/compare mode register (output
          mode)</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>CC3S</name>
                     <description>Capture/Compare 3
              selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OC3FE</name>
                     <description>Output compare 3 fast
              enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC3PE</name>
                     <description>Output compare 3 preload
              enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC3M</name>
                     <description>Output compare 3 mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>OC3CE</name>
                     <description>Output compare 3 clear
              enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC4S</name>
                     <description>Capture/Compare 4
              selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OC4FE</name>
                     <description>Output compare 4 fast
              enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC4PE</name>
                     <description>Output compare 4 preload
              enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC4M</name>
                     <description>Output compare 4 mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>OC4CE</name>
                     <description>Output compare 4 clear
              enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCER</name>
               <description>capture/compare enable
          register</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>CC1E</name>
                     <description>Capture/Compare 1 output
              enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1P</name>
                     <description>Capture/Compare 1 output
              Polarity</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1NE</name>
                     <description>Capture/Compare 1 complementary output
              enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1NP</name>
                     <description>Capture/Compare 1 output
              Polarity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC2E</name>
                     <description>Capture/Compare 2 output
              enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC2P</name>
                     <description>Capture/Compare 2 output
              Polarity</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC2NE</name>
                     <description>Capture/Compare 2 complementary output
              enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC2NP</name>
                     <description>Capture/Compare 2 output
              Polarity</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC3E</name>
                     <description>Capture/Compare 3 output
              enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC3P</name>
                     <description>Capture/Compare 3 output
              Polarity</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC3NE</name>
                     <description>Capture/Compare 3 complementary output
              enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC3NP</name>
                     <description>Capture/Compare 3 output
              Polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC4E</name>
                     <description>Capture/Compare 4 output
              enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC4P</name>
                     <description>Capture/Compare 3 output
              Polarity</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <description>counter</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PSC</name>
               <description>prescaler</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>PSC</name>
                     <description>Prescaler value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ARR</name>
               <description>auto-reload register</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>ARR</name>
                     <description>Auto-reload value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RCR</name>
               <description>repetition counter register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>REP</name>
                     <description>Repetition counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>1,2,3,4</dimIndex>
               <name>CCR%s</name>
               <description>capture/compare register %s</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>CCR</name>
                     <description>Capture/Compare value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDTR</name>
               <description>break and dead-time register</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>DTG</name>
                     <description>Dead-time generator setup</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock configuration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSSI</name>
                     <description>Off-state selection for Idle
              mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSR</name>
                     <description>Off-state selection for Run
              mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKE</name>
                     <description>Break enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKP</name>
                     <description>Break polarity</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AOE</name>
                     <description>Automatic output enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOE</name>
                     <description>Main output enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCR</name>
               <description>DMA control register</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>DBA</name>
                     <description>DMA base address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DBL</name>
                     <description>DMA burst length</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMAR</name>
               <description>DMA address for full transfer</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>DMAB</name>
                     <description>DMA register for burst
              accesses</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
